liamHowatt/mcp_forth/esp32s3_backend.c
/*

; defined word
;   align so that the following fragment addr mod 4 is 0 or 1
call0 42    ; signed 20 bits

; runtime word
;   align so that the following fragment addr mod 4 is 0 or 1
movi.n  s0, 42
callx0  rc

; push literal
; add ebx, 4
; mov [ebx], eax
movi.n  dt, 42

; exit word
; if using loops
mov.n   rs, rb
l32i.n  rb, rs, rso+4
ret.n
; if calling a function
add.n   rs, rs, n4
l32i.n  lr, rs, rso+4
ret.n
; if using loops and calling a function
mov.n   rs, rb
l32i.n  rb, rs, rso+4
l32i.n  lr, rs, rso+8
ret.n

; defined word location
;   align 32 bit
; if using loops
s32i.n  rb, rs, rso+4
mov.n   rb, rs
addi.n  rs, rs, 4
; if calling a function
s32i.n  lr, rs, rso+4
addi.n  rs, rs, 4
; if using loops and calling a function
s32i.n  rb, rs, rso+4
s32i.n  lr, rs, rso+8
mov.n   rb, rs
addi.n  rs, rs, 8

; push data address
; add ebx, 4
; mov [ebx], eax
l32i.n  dt, cs, DATA
addi.n  dt, dt, 42

; declare variable
addi.n  dp, dp, 3
and     dp, dp, n4
s32i.n  dp, va, 42*4
addi.n  dp, dp, 4

; use variable or constant
; add ebx, 4
; mov [ebx], eax
l32i.n  dt, va, 42*4

; halt
l32i.n  lr, sp, 4
ret.n

; branch location
;   align so that addr mod 4 is 0 or 1
; (empty)

; branch if zero
mov.n   s0, dt
l32i.n  dt, ds, dso
add.n   ds, ds, n4
beqz.n  s0, 42

; branch
j 42

; do
l32i.n  s0, ds, dso
addi.n  rs, rs, 8
s32i.n  s0, rs, rso-4
s32i.n  dt, rs, rso
l32i.n  dt, ds, dso-4
addi    ds, ds, -8
; DO is always followed by
; a branch location which won't
; have any elide flags, so don't
; bother replacing the above 2 lines with
;     add.n   ds, ds, n4
;     ; mov eax, [ebx]
;     ; sub ebx, 4

; loop
l32i.n  s0, rs, rso
addi.n  s0, s0, 1
s32i.n  s0, rs, rso
l32i.n  s1, rs, rso-4
blt     s0, s1, 42
addi    rs, rs, -8

; push offset address
; add ebx, 4
; mov [ebx], eax
l32i.n  dt, cs, BIN_START
addi.n  dt, dt, 42

; push callback
; add ebx, 4
; mov [ebx], eax
l32i.n  dt, cs, CALLBACK_TARGETS
l32i.n  dt, dt, 42

; declare constant
s32i.n  dt, va, 42*4
; mov eax, [ebx]
; sub ebx, 4

; execute
;   align so that the following fragment addr mod 4 is 0 or 1
mov.n  s0, dt
; mov eax, [ebx]
; sub ebx, 4
callx0 s0

; thread create
;   align so that the following fragment addr mod 4 is 0 or 1
movi.n  s0, -1
callx0  rc

; thread join
;   align so that the following fragment addr mod 4 is 0 or 1
movi.n  s0, -2
callx0  rc

; entry
s32i.n  lr, sp, 4

*/

#include "mcp_forth.h"
#include "esp32s3_backend_generated.h"
#include "esp32s3.h"

static int get_flags(const m4_fragment_t * fragment)
{
    switch (fragment->op) {
        case M4_OPCODE_BUILTIN_WORD:
            return m4_esp32s3_backend_table[fragment->param].flags;
        case M4_OPCODE_DEFINED_WORD:
            return 0;
        case M4_OPCODE_RUNTIME_WORD:
            return 0;
        case M4_OPCODE_PUSH_LITERAL:
            return M4_BACKEND_FLAG_A | M4_BACKEND_FLAG_B | M4_BACKEND_FLAG_CLOB;
        case M4_OPCODE_EXIT_WORD:
            return 0;
        case M4_OPCODE_DEFINED_WORD_LOCATION:
            return 0;
        case M4_OPCODE_PUSH_DATA_ADDRESS:
            return M4_BACKEND_FLAG_A | M4_BACKEND_FLAG_B | M4_BACKEND_FLAG_CLOB;
        case M4_OPCODE_DECLARE_VARIABLE:
            return 0;
        case M4_OPCODE_USE_VARIABLE_OR_CONSTANT:
            return M4_BACKEND_FLAG_A | M4_BACKEND_FLAG_B | M4_BACKEND_FLAG_CLOB;
        case M4_OPCODE_HALT:
            return 0;
        case M4_OPCODE_BRANCH_LOCATION:
            return 0;
        case M4_OPCODE_BRANCH_IF_ZERO:
            return 0;
        case M4_OPCODE_BRANCH:
            return 0;
        case M4_OPCODE_DO:
            return 0;
        case M4_OPCODE_LOOP:
            return 0;
        case M4_OPCODE_PUSH_OFFSET_ADDRESS:
            return M4_BACKEND_FLAG_A | M4_BACKEND_FLAG_B | M4_BACKEND_FLAG_CLOB;
        case M4_OPCODE_PUSH_CALLBACK:
            return M4_BACKEND_FLAG_A | M4_BACKEND_FLAG_B | M4_BACKEND_FLAG_CLOB;
        case M4_OPCODE_DECLARE_CONSTANT:
            return M4_BACKEND_FLAG_Z | M4_BACKEND_FLAG_Y;
        case M4_OPCODE_EXECUTE:
            return 0;
        case M4_OPCODE_THREAD_CREATE:
        case M4_OPCODE_THREAD_JOIN:
            return 0;
        case M4_OPCODE_ENTRY:
            return 0;
        default:
            assert(0);
    }
}

static void l32i_n(uint8_t ** dst, int regdst, int regptr, int offset)
{
    assert((regdst & ~0xf) == 0);
    assert((regptr & ~0xf) == 0);
    assert((offset & ~0b111100) == 0);
    (*dst)[0] = (regdst << 4) | 0b1000;
    (*dst)[1] = (offset << 2) | regptr;
    *dst += 2;
}

static void s32i_n(uint8_t ** dst, int regsrc, int regptr, int offset)
{
    assert((regsrc & ~0xf) == 0);
    assert((regptr & ~0xf) == 0);
    assert((offset & ~0b111100) == 0);
    (*dst)[0] = (regsrc << 4) | 0b1001;
    (*dst)[1] = (offset << 2) | regptr;
    *dst += 2;
}

static void add_n(uint8_t ** dst, int regdst, int regleft, int regright)
{
    assert((regdst & ~0xf) == 0);
    assert((regleft & ~0xf) == 0);
    assert((regright & ~0xf) == 0);
    (*dst)[0] = (regright << 4) | 0b1010;
    (*dst)[1] = (regdst << 4) | regleft;
    *dst += 2;
}

static void cpy_and_inc(uint8_t ** dst, const uint8_t * src, int n)
{
    memcpy(*dst, src, n);
    *dst += n;
}

static void le3(uint8_t ** dst, uint32_t val)
{
    (*dst)[0] = val & 0xff;
    val >>= 8;
    (*dst)[1] = val & 0xff;
    val >>= 8;
    (*dst)[2] = val & 0xff;
    *dst += 3;
}

/*
target_pos  ==  (call0_pos & -4) + (offset << 2) + 4
(target_pos - (call0_pos & -4) - 4) >> 2  ==  offset
*/
static void call0(uint8_t ** dst, int target_pos, int call0_pos)
{
    assert(target_pos % 4 == 0);
    int offset = (target_pos - (call0_pos & -4) - 4) >> 2;
    assert(offset >= -131072 && offset <= 131071); /* TODO handle further offsets */

    uint32_t code = (offset << 6) | 0x5;
    le3(dst, code);
}

static void nop_n(uint8_t ** dst)
{
    (*dst)[0] = 0x3d;
    (*dst)[1] = 0xf0;
    *dst += 2;
}

static void callx0(uint8_t ** dst, int reg)
{
    assert((reg & ~0xf) == 0);
    uint32_t code = (reg << 8) | (0b11 << 6);
    le3(dst, code);
}

