liamHowatt/mcp_forth/esp32s3_backend.c
static void mov_n(uint8_t ** dst, int regdst, int regsrc)
{
    assert((regdst & ~0xf) == 0);
    assert((regsrc & ~0xf) == 0);
    (*dst)[0] = (regdst << 4) | 0b1101;
    (*dst)[1] = regsrc;
    *dst += 2;
}

static void movi_n(uint8_t ** dst, int regdst, int imm)
{
    assert((regdst & ~0xf) == 0);
    assert(imm >= -32 && imm <= 95);
    (*dst)[0] = (imm & 0x70) | 0b1100;
    (*dst)[1] = ((imm & 0x0f) << 4) | regdst;
    *dst += 2;
}

static void ret_n(uint8_t ** dst)
{
    (*dst)[0] = 0b00001101;
    (*dst)[1] = 0b11110000;
    *dst += 2;
}

static void addi_n(uint8_t ** dst, int regdst, int regsrc, int imm)
{
    assert((regdst & ~0xf) == 0);
    assert((regsrc & ~0xf) == 0);
    assert(imm >= -1 && imm <= 15 && imm != 0);
    (*dst)[0] = ((imm == -1 ? 0 : imm) << 4) | 0b1011;
    (*dst)[1] = (regdst << 4) | regsrc;
    *dst += 2;
}

static void l32i(uint8_t ** dst, int regdst, int regptr, int offset)
{
    assert((regdst & ~0xf) == 0);
    assert((regptr & ~0xf) == 0);
    assert((offset & ~0x3fc) == 0);
    (*dst)[0] = (regdst << 4) | 0b0010;
    (*dst)[1] = (0b0010 << 4) | regptr;
    (*dst)[2] = offset >> 2;
    *dst += 3;
}

static void s32i(uint8_t ** dst, int regsrc, int regptr, int offset)
{
    assert((regsrc & ~0xf) == 0);
    assert((regptr & ~0xf) == 0);
    assert((offset & ~0x3fc) == 0);
    (*dst)[0] = (regsrc << 4) | 0b0010;
    (*dst)[1] = (0b0110 << 4) | regptr;
    (*dst)[2] = offset >> 2;
    *dst += 3;
}

static void addi(uint8_t ** dst, int regdst, int regsrc, int imm)
{
    assert((regdst & ~0xf) == 0);
    assert((regsrc & ~0xf) == 0);
    assert(imm >= -128 && imm <= 127);
    (*dst)[0] = (regdst << 4) | 0b0010;
    (*dst)[1] = (0b1100 << 4) | regsrc;
    (*dst)[2] = imm & 0xff;
    *dst += 3;
}

static void and(uint8_t ** dst, int regdst, int regleft, int regright)
{
    assert((regdst & ~0xf) == 0);
    assert((regleft & ~0xf) == 0);
    assert((regright & ~0xf) == 0);
    (*dst)[0] = (regright << 4) | 0b0000;
    (*dst)[1] = (regdst << 4) | regleft;
    (*dst)[2] = 0b00010000;
    *dst += 3;
}

static void addmi(uint8_t ** dst, int regdst, int regsrc, int raw_imm)
{
    assert((regdst & ~0xf) == 0);
    assert((regsrc & ~0xf) == 0);
    assert(raw_imm >= -128 && raw_imm <= 127);
    (*dst)[0] = (regdst << 4) | 0b0010;
    (*dst)[1] = (0b1101 << 4) | regsrc;
    (*dst)[2] = raw_imm;
    *dst += 3;
}

static bool s32i_l32i_auto_using_relaxation_is_representable(int relaxation, int offset)
{
    assert(!(offset & 0x3));
    offset /= 4;
    assert(offset <= 0x1fff); /* TODO handle offsets more than 8191 */
    switch(relaxation) {
        case 0: return offset <= 0xf;
        case 1: return offset <= 0xff;
        case 2: return (offset & 0xff) <= 0xf;
        default: return true;
    }
}

static int s32i_l32i_auto_using_relaxation_size(int relaxation)
{
    switch(relaxation) {
        case 0: return 2;
        case 1: return 3;
        case 2: return 5;
        case 3: return 6;
        default: assert(0);
    }
}

static int s32i_l32i_auto_size(int offset)
{
    int relaxation = 0;
    while(!s32i_l32i_auto_using_relaxation_is_representable(relaxation, offset)) {
        relaxation += 1;
    }
    return s32i_l32i_auto_using_relaxation_size(relaxation);
}

static void s32i_l32i_auto_using_relaxation(bool is_store, int relaxation, uint8_t ** dst, int regsrcdst, int regptr,
                                             int offset, int regscratch)
{
    assert(!(offset & 0x3));
    assert(offset / 4 <= 0x1fff); /* TODO handle offsets more than 8191 */
    switch(relaxation) {
        case 0:
            if(is_store)
                s32i_n(dst, regsrcdst, regptr, offset);
            else
                l32i_n(dst, regsrcdst, regptr, offset);
            return;
        case 1:
            if(is_store)
                s32i(dst, regsrcdst, regptr, offset);
            else
                l32i(dst, regsrcdst, regptr, offset);
            return;
        case 2:
            addmi(dst, regscratch, regptr, (offset & ~0x3ff) >> 8);
            if(is_store)
                s32i_n(dst, regsrcdst, regscratch, offset & 0x3ff);
            else
                l32i_n(dst, regsrcdst, regscratch, offset & 0x3ff);
            return;
        case 3:
            addmi(dst, regscratch, regptr, (offset & ~0x3ff) >> 8);
            if(is_store)
                s32i(dst, regsrcdst, regscratch, offset & 0x3ff);
            else
                l32i(dst, regsrcdst, regscratch, offset & 0x3ff);
            return;
        default:
            assert(0);
    }
}

static void s32i_l32i_auto(bool is_store, uint8_t ** dst, int regsrcdst, int regptr, int offset,
                           int regscratch)
{
    int relaxation = 0;
    while(!s32i_l32i_auto_using_relaxation_is_representable(relaxation, offset)) {
        relaxation += 1;
    }
    s32i_l32i_auto_using_relaxation(is_store, relaxation, dst, regsrcdst, regptr, offset, regscratch);
}

static bool movi_auto_using_relaxation_is_representable(m4_compiler_ctx_t * compiler, int relaxation, int imm)
{
    switch(relaxation) {
        case 0: return imm >= -32 && imm <= 95;
        case 1: return imm >= -2048 && imm <= 2047;
        default: {
            int literal_offset = m4_compiler_literal(compiler, imm);
            return s32i_l32i_auto_using_relaxation_is_representable(relaxation - 2, literal_offset * 4);
        }
    }
}

static int movi_auto_using_relaxation_size(int relaxation)
{
    switch(relaxation) {
        case 0: return 2;
        case 1: return 3;
        default: return s32i_l32i_auto_using_relaxation_size(relaxation - 2);
    }
}

static int movi_auto_size(m4_compiler_ctx_t * compiler, int imm)
{
    int relaxation = 0;
    while(!movi_auto_using_relaxation_is_representable(compiler, relaxation, imm)) {
        relaxation += 1;
    }
    return movi_auto_using_relaxation_size(relaxation);
}

static void movi_auto_using_relaxation(m4_compiler_ctx_t * compiler, int relaxation, uint8_t ** dst, int regdst, int imm)
{
    switch(relaxation) {
        case 0:
            movi_n(dst, regdst, imm);
            return;
        case 1:
            /* movi regdst, imm */
            (*dst)[0] = (regdst << 4) | 0b0010;
            (*dst)[1] = (0b1010 << 4) | ((imm & 0xf00) >> 8);
            (*dst)[2] = imm & 0x0ff;
            *dst += 3;
            return;
        default: {
            int literal_offset = m4_compiler_literal(compiler, imm);
            s32i_l32i_auto_using_relaxation(false, relaxation - 2, dst, regdst, LA, literal_offset * 4, regdst);
            return;
        }
    }
}

static void movi_auto(m4_compiler_ctx_t * compiler, uint8_t ** dst, int regdst, int imm)
{
    int relaxation = 0;
    while(!movi_auto_using_relaxation_is_representable(compiler, relaxation, imm)) {
        relaxation += 1;
    }
    movi_auto_using_relaxation(compiler, relaxation, dst, regdst, imm);
}

static bool addi_auto_using_relaxation_is_representable(m4_compiler_ctx_t * compiler, int relaxation, int imm)
{
    switch(relaxation) {
        case 0: return imm == 0;
        case 1: return imm >= -1 && imm <= 15 && imm != 0;
        case 2: return imm >= -128 && imm <= 127;
        default: return movi_auto_using_relaxation_is_representable(compiler, relaxation - 3, imm);
    }
}

static int addi_auto_using_relaxation_size(int relaxation)
{
    switch(relaxation) {
        case 0: return 0;
        case 1: return 2;
        case 2: return 3;
        default: return movi_auto_using_relaxation_size(relaxation - 3) + 2;
    }
}

static int addi_auto_size(m4_compiler_ctx_t * compiler, int imm)
{
    int relaxation = 0;
    while(!addi_auto_using_relaxation_is_representable(compiler, relaxation, imm)) {
        relaxation += 1;
    }
    return addi_auto_using_relaxation_size(relaxation);
}

static void addi_auto_using_relaxation(m4_compiler_ctx_t * compiler, int relaxation, uint8_t ** dst, int regdst, int regsrc, int imm, int regscratch)
{
    switch(relaxation) {
        case 0:
            return;
        case 1:
            addi_n(dst, regdst, regsrc, imm);
            return;
        case 2:
            addi(dst, regdst, regsrc, imm);
            return;
        default:
            movi_auto_using_relaxation(compiler, relaxation - 3, dst, regscratch, imm);
            add_n(dst, regdst, regsrc, regscratch);
            return;
    }
}

