liamHowatt/mcp_forth/esp32s3_backend.c
static void addi_auto(m4_compiler_ctx_t * compiler, uint8_t ** dst, int regdst, int regsrc, int imm, int regscratch)
{
    int relaxation = 0;
    while(!addi_auto_using_relaxation_is_representable(compiler, relaxation, imm)) {
        relaxation += 1;
    }
    return addi_auto_using_relaxation(compiler, relaxation, dst, regdst, regsrc, imm, regscratch);
}

static void beqz_n(uint8_t ** dst, int regsrc, int offset)
{
    assert((regsrc & ~0xf) == 0);
    assert(offset >= 0 && offset <= 63);
    (*dst)[0] = (offset & 0x30) | 0b10001100;
    (*dst)[1] = (offset << 4) | regsrc;
    *dst += 2;
}

static void bnez_n(uint8_t ** dst, int regsrc, int offset)
{
    assert((regsrc & ~0xf) == 0);
    assert(offset >= 0 && offset <= 63);
    (*dst)[0] = (offset & 0x30) | 0b11001100;
    (*dst)[1] = (offset << 4) | regsrc;
    *dst += 2;
}

static void beqz(uint8_t ** dst, int regsrc, int offset)
{
    assert((regsrc & ~0xf) == 0);
    assert(offset >= -2048 && offset <= 2047);
    uint32_t code = (offset << 12) | (regsrc << 8) | 0b10110;
    le3(dst, code);
}

static void blt(uint8_t ** dst, int regleft, int regright, int offset)
{
    assert((regleft & ~0xf) == 0);
    assert((regright & ~0xf) == 0);
    assert(offset >= -128 && offset <= 127);
    (*dst)[0] = (regright << 4) | 0b0111;
    (*dst)[1] = (0b0010 << 4) | regleft;
    (*dst)[2] = offset & 0xff;
    *dst += 3;
}

static void bge(uint8_t ** dst, int regleft, int regright, int offset)
{
    assert((regleft & ~0xf) == 0);
    assert((regright & ~0xf) == 0);
    assert(offset >= -128 && offset <= 127);
    (*dst)[0] = (regright << 4) | 0b0111;
    (*dst)[1] = (0b1010 << 4) | regleft;
    (*dst)[2] = offset & 0xff;
    *dst += 3;
}

static void j(uint8_t ** dst, int offset)
{
    assert(offset >= -131072 && offset <= 131071);
    uint32_t code = (offset << 6) | 0b110;
    le3(dst, code);
}

static int beqz_auto_size(int relaxation, int beqz_pos)
{
    switch(relaxation) {
        case 0: return 2;
        case 1: return 3;
        case 2: {
            int skip_target_pos = beqz_pos + 5;
            if((skip_target_pos % 4) <= 1) return 5;
            return 7;
        }
    }
    assert(0);
}

static bool beqz_auto_is_representable(int relaxation, int target_pos, int beqz_pos)
{
    int offset = target_pos - beqz_pos - 4;
    switch(relaxation) {
        case 0:
            return offset >= 0 && offset <= 63;
        case 1:
            return offset >= -2048 && offset <= 2047;
        case 2:
            return true;
        default:
            assert(0);
    }
}

static void beqz_auto(uint8_t ** dst, int relaxation, int regsrc, int target_pos, int beqz_pos)
{
    int offset = target_pos - beqz_pos - 4;
    switch(relaxation) {
        case 0:
            assert(offset >= 0 && offset <= 63);
            beqz_n(dst, regsrc, offset);
            break;
        case 1:
            assert(offset >= -2048 && offset <= 2047);
            beqz(dst, regsrc, offset);
            break;
        case 2: {
            int skip_target_pos = beqz_pos + 5;
            if((skip_target_pos % 4) <= 1) {
                bnez_n(dst, regsrc, 1);
                j(dst, offset - 2);
            }
            else {
                bnez_n(dst, regsrc, 3);
                j(dst, offset - 2);
                nop_n(dst);
            }
            break;
        }
        default:
            assert(0);
    }
}

static int blt_auto_size(int relaxation, int blt_pos)
{
    switch(relaxation) {
        case 0: return 3;
        case 1: {
            int skip_target_pos = blt_pos + 6;
            if((skip_target_pos % 4) <= 1) return 6;
            return 8;
        }
    }
    assert(0);
}

static bool blt_auto_is_representable(int relaxation, int target_pos, int blt_pos)
{
    int offset = target_pos - blt_pos - 4;
    switch(relaxation) {
        case 0:
            return offset >= -128 && offset <= 127;
        case 1:
            return true;
        default:
            assert(0);
    }
}

static void blt_auto(uint8_t ** dst, int relaxation, int regleft, int regright,
                     int target_pos, int blt_pos)
{
    int offset = target_pos - blt_pos - 4;
    switch(relaxation) {
        case 0:
            assert(offset >= -128 && offset <= 127);
            blt(dst, regleft, regright, offset);
            break;
        case 1: {
            int skip_target_pos = blt_pos + 6;
            if((skip_target_pos % 4) <= 1) {
                bge(dst, regleft, regright, 2);
                j(dst, offset - 3);
            }
            else {
                bge(dst, regleft, regright, 4);
                j(dst, offset - 3);
                nop_n(dst);
            }
            break;
        }
        default:
            assert(0);
    }
}

static int fragment_bin_size(m4_compiler_ctx_t * compiler, const m4_fragment_t * all_fragments,
                             const int * sequence, int sequence_len, int sequence_i) {
    int needs = m4_backend_fragment_get_needed_chores(all_fragments, sequence, sequence_len, sequence_i, get_flags);
    int size = 0;
    if(needs & M4_BACKEND_FLAG_A) size += sizeof(m4_esp32s3_backend_chore_a);
    if(needs & M4_BACKEND_FLAG_B) size += sizeof(m4_esp32s3_backend_chore_b);
    const m4_fragment_t * fragment = &all_fragments[sequence[sequence_i]];
    switch(fragment->op) {
        case M4_OPCODE_BUILTIN_WORD:
            size += m4_esp32s3_backend_table[fragment->param].len;
            break;
        case M4_OPCODE_DEFINED_WORD:
            size += (fragment->position + size + 3) % 4 <= 1 ? 3 : 5;
            break;
        case M4_OPCODE_RUNTIME_WORD:
            size += movi_auto_size(compiler, fragment->param);
            size += (fragment->position + size + 3) % 4 <= 1 ? 3 : 5;
            break;
        case M4_OPCODE_PUSH_LITERAL:
            size += movi_auto_size(compiler, fragment->param);
            break;
        case M4_OPCODE_EXIT_WORD: {
            size += 2;
            int defined_word_param = all_fragments[fragment->param].param;
            if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_LOOPS
               || defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_CALLS) size += 4;
            else if(defined_word_param == (M4_DEFINED_WORD_LOCATION_PARAM_LOOPS
                                           | M4_DEFINED_WORD_LOCATION_PARAM_CALLS)) size += 6;
            break;
        }
        case M4_OPCODE_DEFINED_WORD_LOCATION: {
            int defined_word_param = fragment->param;
            if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_LOOPS) size += 6;
            else if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_CALLS) size += 4;
            else if(defined_word_param == (M4_DEFINED_WORD_LOCATION_PARAM_LOOPS
                                           | M4_DEFINED_WORD_LOCATION_PARAM_CALLS)) size += 8;
            break;
        }
        case M4_OPCODE_PUSH_DATA_ADDRESS:
            size += 2 + addi_auto_size(compiler, fragment->param);
            break;
        case M4_OPCODE_DECLARE_VARIABLE:
            size += 7 + s32i_l32i_auto_size(fragment->param * 4);
            break;
        case M4_OPCODE_USE_VARIABLE_OR_CONSTANT:
            size += s32i_l32i_auto_size(fragment->param * 4);
            break;
        case M4_OPCODE_HALT:
            size += 4;
            break;
        case M4_OPCODE_BRANCH_LOCATION:
            break;
        case M4_OPCODE_BRANCH_IF_ZERO:
            size += 6;
            size += beqz_auto_size(fragment->relaxation, fragment->position + size);
            break;
        case M4_OPCODE_BRANCH:
            size += 3;
            break;
        case M4_OPCODE_DO:
            size += 13;
            break;
        case M4_OPCODE_LOOP:
            size += 8;
            size += blt_auto_size(fragment->relaxation, fragment->position + size);
            size += 3;
            break;
        case M4_OPCODE_PUSH_OFFSET_ADDRESS:
            size += 2 + addi_auto_using_relaxation_size(fragment->relaxation);
            break;
        case M4_OPCODE_PUSH_CALLBACK:
            size += 2 + s32i_l32i_auto_size(fragment->param * 4);
            break;
        case M4_OPCODE_DECLARE_CONSTANT:
            size += s32i_l32i_auto_size(fragment->param * 4);
            break;
        case M4_OPCODE_EXECUTE:
            size += 6;
            if((fragment->position + size + 3) % 4 > 1) size += 2;
            size += 3;
            break;
        case M4_OPCODE_THREAD_CREATE:
        case M4_OPCODE_THREAD_JOIN:
            size += 2;
            if((fragment->position + size + 3) % 4 > 1) size += 2;
            size += 3;
            break;
        case M4_OPCODE_ENTRY:
            size += 2;
            break;
        default:
            assert(0);
    }
    if(needs & M4_BACKEND_FLAG_Z) size += sizeof(m4_esp32s3_backend_chore_z);
    if(needs & M4_BACKEND_FLAG_Y) size += sizeof(m4_esp32s3_backend_chore_y);

