liamHowatt/mcp_forth/esp32s3_backend.c
    if(sequence_i + 1 < sequence_len) {
        m4_opcode_t next_fragment_op = all_fragments[sequence[sequence_i + 1]].op;
        if(next_fragment_op == M4_OPCODE_DEFINED_WORD_LOCATION) {
            size += (4 - (fragment->position + size) % 4) % 4;
        }
        else if(next_fragment_op == M4_OPCODE_BRANCH_LOCATION) {
            if((fragment->position + size) % 4 > 1) size += 2;
        }
    }

    return size;
}

static bool fragment_bin_is_representable(m4_compiler_ctx_t * compiler, const m4_fragment_t * all_fragments,
                                          const int * sequence, int sequence_len, int sequence_i)
{
    const m4_fragment_t * fragment = &all_fragments[sequence[sequence_i]];
    m4_opcode_t op = fragment->op;
    int needs;
    int start_chores_len;
    switch(op) {
        case M4_OPCODE_BRANCH_IF_ZERO:
        case M4_OPCODE_LOOP:
            needs = m4_backend_fragment_get_needed_chores(all_fragments, sequence, sequence_len, sequence_i, get_flags);
            start_chores_len = 0;
            if(needs & M4_BACKEND_FLAG_A) start_chores_len += sizeof(m4_esp32s3_backend_chore_a);
            if(needs & M4_BACKEND_FLAG_B) start_chores_len += sizeof(m4_esp32s3_backend_chore_b);
            break;
        case M4_OPCODE_PUSH_OFFSET_ADDRESS:
            break;
        default:
            return true;
    }
    switch(op) {
        case M4_OPCODE_BRANCH_IF_ZERO:
            return beqz_auto_is_representable(fragment->relaxation, all_fragments[fragment->param].position,
                                              fragment->position + start_chores_len);
        case M4_OPCODE_LOOP:
            return blt_auto_is_representable(fragment->relaxation, all_fragments[fragment->param].position,
                                             fragment->position + start_chores_len);
        case M4_OPCODE_PUSH_OFFSET_ADDRESS:
            return addi_auto_using_relaxation_is_representable(compiler, fragment->relaxation, all_fragments[fragment->param].position);
        default:
            assert(0);
    }
}

static void fragment_bin_dump(m4_compiler_ctx_t * compiler, const m4_fragment_t * all_fragments,
                              const int * sequence, int sequence_len, int sequence_i, uint8_t * dst) {
    uint8_t * dst_start = dst;
    int needs = m4_backend_fragment_get_needed_chores(all_fragments, sequence, sequence_len, sequence_i, get_flags);
    if(needs & M4_BACKEND_FLAG_A) cpy_and_inc(&dst, m4_esp32s3_backend_chore_a, sizeof(m4_esp32s3_backend_chore_a));
    if(needs & M4_BACKEND_FLAG_B) cpy_and_inc(&dst, m4_esp32s3_backend_chore_b, sizeof(m4_esp32s3_backend_chore_b));
    const m4_fragment_t * fragment = &all_fragments[sequence[sequence_i]];
    switch(fragment->op) {
        case M4_OPCODE_BUILTIN_WORD:
            cpy_and_inc(&dst,
                        &m4_esp32s3_backend_code[m4_esp32s3_backend_table[fragment->param].pos],
                        m4_esp32s3_backend_table[fragment->param].len);
            break;
        case M4_OPCODE_DEFINED_WORD: {
            int call0_pos = fragment->position + (dst - dst_start);
            if((call0_pos + 3) % 4 > 1) {
                nop_n(&dst);
                call0_pos += 2;
            }
            call0(&dst, all_fragments[fragment->param].position, call0_pos);
            break;
        }
        case M4_OPCODE_RUNTIME_WORD: {
            movi_auto(compiler, &dst, S0, fragment->param);
            int callx0_pos = fragment->position + (dst - dst_start);
            if((callx0_pos + 3) % 4 > 1) {
                nop_n(&dst);
            }
            callx0(&dst, RC);
            break;
        }
        case M4_OPCODE_PUSH_LITERAL:
            movi_auto(compiler, &dst, DT, fragment->param);
            break;
        case M4_OPCODE_EXIT_WORD: {
            int defined_word_param = all_fragments[fragment->param].param;
            if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_LOOPS) {
                mov_n(&dst, RS, RB);
                l32i_n(&dst, RB, RS, RSO+4);
            }
            else if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_CALLS) {
                add_n(&dst, RS, RS, N4);
                l32i_n(&dst, LR, RS, RSO+4);
            }
            else if(defined_word_param == (M4_DEFINED_WORD_LOCATION_PARAM_LOOPS
                                           | M4_DEFINED_WORD_LOCATION_PARAM_CALLS)) {
                mov_n(&dst, RS, RB);
                l32i_n(&dst, RB, RS, RSO+4);
                l32i_n(&dst, LR, RS, RSO+8);
            }
            ret_n(&dst);
            break;
        }
        case M4_OPCODE_DEFINED_WORD_LOCATION: {
            int defined_word_param = fragment->param;
            if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_LOOPS) {
                s32i_n(&dst, RB, RS, RSO+4);
                mov_n(&dst, RB, RS);
                addi_n(&dst, RS, RS, 4);
            }
            else if(defined_word_param == M4_DEFINED_WORD_LOCATION_PARAM_CALLS) {
                s32i_n(&dst, LR, RS, RSO+4);
                addi_n(&dst, RS, RS, 4);
            }
            else if(defined_word_param == (M4_DEFINED_WORD_LOCATION_PARAM_LOOPS
                                           | M4_DEFINED_WORD_LOCATION_PARAM_CALLS)) {
                s32i_n(&dst, RB, RS, RSO+4);
                s32i_n(&dst, LR, RS, RSO+8);
                mov_n(&dst, RB, RS);
                addi_n(&dst, RS, RS, 8);
            }
            break;
        }
        case M4_OPCODE_PUSH_DATA_ADDRESS:
            l32i_n(&dst, DT, CS, DATA);
            addi_auto(compiler, &dst, DT, DT, fragment->param, S0);
            break;
        case M4_OPCODE_DECLARE_VARIABLE:
            addi_n(&dst, DP, DP, 3);
            and(&dst, DP, DP, N4);
            s32i_l32i_auto(true, &dst, DP, VA, fragment->param * 4, S0);
            addi_n(&dst, DP, DP, 4);
            break;
        case M4_OPCODE_USE_VARIABLE_OR_CONSTANT:
            s32i_l32i_auto(false, &dst, DT, VA, fragment->param * 4, S0);
            break;
        case M4_OPCODE_HALT:
            l32i_n(&dst, LR, SP, 4);
            ret_n(&dst);
            break;
        case M4_OPCODE_BRANCH_LOCATION:
            break;
        case M4_OPCODE_BRANCH_IF_ZERO:
            mov_n(&dst, S0, DT);
            l32i_n(&dst, DT, DS, DSO);
            add_n(&dst, DS, DS, N4);
            beqz_auto(&dst, fragment->relaxation, S0, all_fragments[fragment->param].position,
                      fragment->position + (dst - dst_start));
            break;
        case M4_OPCODE_BRANCH: {
            int j_pos = fragment->position + (dst - dst_start);
            int target_pos = all_fragments[fragment->param].position;
            int offset = target_pos - j_pos - 4;
            j(&dst, offset);
            break;
        }
        case M4_OPCODE_DO:
            l32i_n(&dst, S0, DS, DSO);
            addi_n(&dst, RS, RS, 8);
            s32i_n(&dst, S0, RS, RSO-4);
            s32i_n(&dst, DT, RS, RSO);
	    l32i_n(&dst, DT, DS, DSO-4);
            addi(&dst,   DS, DS, -8);
            break;
        case M4_OPCODE_LOOP:
            l32i_n(&dst, S0, RS, RSO);
            addi_n(&dst, S0, S0, 1);
            s32i_n(&dst, S0, RS, RSO);
            l32i_n(&dst, S1, RS, RSO-4);
            blt_auto(&dst, fragment->relaxation, S0, S1, all_fragments[fragment->param].position,
                     fragment->position + (dst - dst_start));
            addi(&dst,   RS, RS, -8);
            break;
        case M4_OPCODE_PUSH_OFFSET_ADDRESS: {
            l32i_n(&dst, DT, CS, BIN_START);
            addi_auto_using_relaxation(compiler, fragment->relaxation, &dst, DT, DT,
                                       all_fragments[fragment->param].position, S0);
            break;
        }
        case M4_OPCODE_PUSH_CALLBACK:
            l32i_n(&dst, DT, CS, CALLBACK_TARGETS);
            s32i_l32i_auto(false, &dst, DT, DT, fragment->param * 4, S0);
        case M4_OPCODE_DECLARE_CONSTANT:
            s32i_l32i_auto(true, &dst, DT, VA, fragment->param * 4, S0);
            break;
        case M4_OPCODE_EXECUTE: {
            mov_n(&dst, S0, DT);
            int callx0_pos = fragment->position + (dst - dst_start) + 4;
            if((callx0_pos + 3) % 4 <= 1) {
                l32i_n(&dst, DT, DS, DSO);
                add_n(&dst, DS, DS, N4);
            }
            else {
                l32i(&dst, DT, DS, DSO);
                addi(&dst, DS, DS, -4);
            }
            callx0(&dst, S0);
            break;
        }
        case M4_OPCODE_THREAD_CREATE: {
            movi_n(&dst, S0, -1);
            int callx0_pos = fragment->position + (dst - dst_start);
            if((callx0_pos + 3) % 4 > 1) {
                nop_n(&dst);
            }
            callx0(&dst, RC);
            break;
        }
        case M4_OPCODE_THREAD_JOIN: {
            movi_n(&dst, S0, -2);
            int callx0_pos = fragment->position + (dst - dst_start);
            if((callx0_pos + 3) % 4 > 1) {
                nop_n(&dst);
            }
            callx0(&dst, RC);
            break;
        }
        case M4_OPCODE_ENTRY:
            s32i_n(&dst, LR, SP, 4);
            break;
        default:
            assert(0);
    }
    if(needs & M4_BACKEND_FLAG_Y) cpy_and_inc(&dst, m4_esp32s3_backend_chore_y, sizeof(m4_esp32s3_backend_chore_y));
    if(needs & M4_BACKEND_FLAG_Z) cpy_and_inc(&dst, m4_esp32s3_backend_chore_z, sizeof(m4_esp32s3_backend_chore_z));

    if(sequence_i + 1 < sequence_len) {
        m4_opcode_t next_fragment_op = all_fragments[sequence[sequence_i + 1]].op;
        if(next_fragment_op == M4_OPCODE_DEFINED_WORD_LOCATION) {
            int pad_amnt = (4 - ((uintptr_t) dst) % 4) % 4;
            memset(dst, 0, pad_amnt);
            dst += pad_amnt;
        }
        else if(next_fragment_op == M4_OPCODE_BRANCH_LOCATION) {
            if(((uintptr_t) dst) % 4 > 1) nop_n(&dst);
        }
    }
}

static bool op_uses_lr(m4_opcode_t op)
{
    switch(op) {
        case M4_OPCODE_DEFINED_WORD:
        case M4_OPCODE_RUNTIME_WORD:
        case M4_OPCODE_EXECUTE:
        case M4_OPCODE_THREAD_CREATE:
        case M4_OPCODE_THREAD_JOIN:
            return true;
        default:
            return false;
    }
}

const m4_backend_t m4_esp32s3_backend = {
    .fragment_bin_size=fragment_bin_size,
    .fragment_bin_is_representable=fragment_bin_is_representable,
    .fragment_bin_dump=fragment_bin_dump,
    .op_uses_lr=op_uses_lr
};
